mattehicks/SCDE/components/ESP32_I2C_Master_Module/include/ESP32_I2C_Master_Module_s.h
// SCDE-Module ESP32_I2C_MASTER (IO-Device for I2C Master communication for I2C-hardware)

#ifndef ESP32_I2C_MASTER_MODULE_S_H
#define ESP32_I2C_MASTER_MODULE_S_H



#include "SCDE_s.h"
#include "WebIf_Module global types.h"

#include "freertos/ringbuf.h"


// -------------------------------------------------------------------------------------------------



/* 
 * ESP32 I2C Controller Hardware Configuration Registers (R / W)
 * ESP32 has 2 I2C Controller units. Base adress is (I2C0) 0x3FF53000 (I2C1) 0x3FF67000
 *
 * Sample to make configuration registers accessible:
 * ESP32_I2C_CONTROLLER_CONF_REG_t *pESP32_I2C_CONTROLLER_CONF_REG =
 *	(ESP32_I2C_CONTROLLER_CONF_REG_t*) 0x3FF57000;
 * Then writeable by: pESP32_I2C_CONTROLLER_CONF_REG[x]->
 */
typedef volatile struct ESP32_I2C_CONTROLLER_CONF_REG_t_s {

  union {

    struct {

      uint32_t scl_low_period:14;             /*This register is used to configure the  low level width of SCL clock.*/
      uint32_t reserved14:    18;
 
    };

    uint32_t val;

  } scl_low_period;

  union {

    struct {

      uint32_t sda_force_out:    1;           /*1：normally output sda data   0: exchange the function of sda_o and sda_oe (sda_o is the original internal output sda signal sda_oe is the enable bit for the internal output sda signal)*/
      uint32_t scl_force_out:    1;           /*1：normally output scl clock  0: exchange the function of scl_o and scl_oe (scl_o is the original internal output scl signal  scl_oe is the enable bit for the internal output scl signal)*/
      uint32_t sample_scl_level: 1;           /*Set this bit to sample data in SCL low level. clear this bit to sample data in SCL high level.*/
      uint32_t reserved3:        1;
      uint32_t ms_mode:          1;           /*Set this bit to configure the module as i2c master  clear this bit to configure the module as i2c slave.*/
      uint32_t trans_start:      1;           /*Set this bit to start sending data in tx_fifo.*/
      uint32_t tx_lsb_first:     1;           /*This bit is used to control the sending mode for  data need to be send. 1：receive data from most significant bit    0：receive data from least significant bit*/
      uint32_t rx_lsb_first:     1;           /*This bit is used to control the storage mode for received data. 1：receive data from most significant bit    0：receive data from least significant bit*/
      uint32_t clk_en:           1;           /*This is the clock gating control bit for reading or writing registers.*/
      uint32_t reserved9:       23;

    };

    uint32_t val;

  } ctr;

  union {

    struct {

      uint32_t ack_rec:             1;        /*This register stores the value of ACK bit.*/
      uint32_t slave_rw:            1;        /*when in slave mode  1：master read slave  0: master write slave.*/
      uint32_t time_out:            1;        /*when I2C takes more than time_out_reg clocks to receive a data then this register changes to high level.*/
      uint32_t arb_lost:            1;        /*when I2C lost control of SDA line  this register changes to high level.*/
      uint32_t bus_busy:            1;        /*1:I2C bus is busy transferring data. 0:I2C bus is in idle state.*/
      uint32_t slave_addressed:     1;        /*when configured as i2c slave  and the address send by master is equal to slave's address  then this bit will be high level.*/
      uint32_t byte_trans:          1;        /*This register changes to high level when one byte is transferred.*/
      uint32_t reserved7:           1;
      uint32_t rx_fifo_cnt:         6;        /*This register represent the amount of data need to send.*/
      uint32_t reserved14:          4;
      uint32_t tx_fifo_cnt:         6;        /*This register stores the amount of received data  in ram.*/
      uint32_t scl_main_state_last: 3;        /*This register stores the value of state machine for i2c module.  3'h0: SCL_MAIN_IDLE  3'h1: SCL_ADDRESS_SHIFT 3'h2: SCL_ACK_ADDRESS  3'h3: SCL_RX_DATA  3'h4 SCL_TX_DATA  3'h5:SCL_SEND_ACK 3'h6:SCL_WAIT_ACK*/
      uint32_t reserved27:          1;
      uint32_t scl_state_last:      3;        /*This register stores the value of state machine to produce SCL. 3'h0: SCL_IDLE  3'h1:SCL_START   3'h2:SCL_LOW_EDGE  3'h3: SCL_LOW   3'h4:SCL_HIGH_EDGE   3'h5:SCL_HIGH  3'h6:SCL_STOP*/
      uint32_t reserved31:          1;

    };

    uint32_t val;

  } status_reg;

  union {

    struct {

      uint32_t tout:      20;                 /*This register is used to configure the max clock number of receiving  a data.*/
      uint32_t reserved20:12;

    };

    uint32_t val;

  } timeout;

  union {

    struct {

      uint32_t addr:       15;                /*when configured as i2c slave  this register is used to configure slave's address.*/
      uint32_t reserved15: 16;
      uint32_t en_10bit:    1;                /*This register is used to enable slave 10bit address mode.*/

   };

   uint32_t val;

  } slave_addr;

  union {

    struct {

      uint32_t rx_fifo_start_addr: 5;         /*This is the offset address of the last receiving data as described in nonfifo_rx_thres_register.*/
      uint32_t rx_fifo_end_addr:   5;         /*This is the offset address of the first receiving data as described in nonfifo_rx_thres_register.*/
      uint32_t tx_fifo_start_addr: 5;         /*This is the offset address of the first  sending data as described in nonfifo_tx_thres register.*/
      uint32_t tx_fifo_end_addr:   5;         /*This is the offset address of the last  sending data as described in nonfifo_tx_thres register.*/
      uint32_t reserved20:        12;

    };

    uint32_t val;

  } fifo_st;

  union {

    struct {

      uint32_t rx_fifo_full_thrhd: 5;
      uint32_t tx_fifo_empty_thrhd:5;         /*Config tx_fifo empty threhd value when using apb fifo access*/
      uint32_t nonfifo_en:         1;         /*Set this bit to enble apb nonfifo access.*/
      uint32_t fifo_addr_cfg_en:   1;         /*When this bit is set to 1 then the byte after address represent the offset address of I2C Slave's ram.*/
      uint32_t rx_fifo_rst:        1;         /*Set this bit to reset rx fifo when using apb fifo access.*/
      uint32_t tx_fifo_rst:        1;         /*Set this bit to reset tx fifo when using apb fifo access.*/
      uint32_t nonfifo_rx_thres:   6;         /*when I2C receives more than nonfifo_rx_thres data  it will produce rx_send_full_int_raw interrupt and update the current offset address of the receiving data.*/
      uint32_t nonfifo_tx_thres:   6;         /*when I2C sends more than nonfifo_tx_thres data  it will produce tx_send_empty_int_raw interrupt and update the current offset address of the sending data.*/
      uint32_t reserved26:         6;

