mattehicks/SCDE/components/ESP32_I2C_Master_Module/include/ESP32_I2C_Master_Module_s.h
    };

    uint32_t val;

  } fifo_conf;

  union {

    struct {

      uint8_t data;                           /*The register represent the byte  data read from rx_fifo when use apb fifo access*/
      uint8_t reserved[3];

    };

    uint32_t val;

  } fifo_data;

  union {

    struct {

      uint32_t rx_fifo_full:     1;           /*The raw interrupt status bit for rx_fifo full when use apb fifo access.*/
      uint32_t tx_fifo_empty:    1;           /*The raw interrupt status bit for tx_fifo empty when use apb fifo access.*/
      uint32_t rx_fifo_ovf:      1;           /*The raw interrupt status bit for receiving data overflow when use apb fifo access.*/
      uint32_t end_detect:       1;           /*The raw interrupt status bit for end_detect_int interrupt. when I2C deals with  the END command  it will produce end_detect_int interrupt.*/
      uint32_t slave_tran_comp:  1;           /*The raw interrupt status bit for slave_tran_comp_int interrupt. when I2C Slave detects the STOP bit  it will produce slave_tran_comp_int interrupt.*/
      uint32_t arbitration_lost: 1;           /*The raw interrupt status bit for arbitration_lost_int interrupt.when I2C lost the usage right of I2C BUS it will produce arbitration_lost_int interrupt.*/
      uint32_t master_tran_comp: 1;           /*The raw interrupt status bit for master_tra_comp_int interrupt. when I2C Master sends or receives a byte it will produce master_tran_comp_int interrupt.*/
      uint32_t trans_complete:   1;           /*The raw interrupt status bit for trans_complete_int interrupt. when I2C Master finished STOP command  it will produce trans_complete_int interrupt.*/
      uint32_t time_out:         1;           /*The raw interrupt status bit for time_out_int interrupt. when I2C takes a lot of time to receive a data  it will produce  time_out_int interrupt.*/
      uint32_t trans_start:      1;           /*The raw interrupt status bit for trans_start_int interrupt. when I2C sends the START bit it will produce trans_start_int interrupt.*/
      uint32_t ack_err:          1;           /*The raw interrupt status bit for ack_err_int interrupt. when I2C receives a wrong ACK bit  it will produce ack_err_int interrupt..*/
      uint32_t rx_rec_full:      1;           /*The raw interrupt status bit for rx_rec_full_int interrupt. when I2C receives more data  than nonfifo_rx_thres  it will produce rx_rec_full_int interrupt.*/
      uint32_t tx_send_empty:    1;           /*The raw interrupt status bit for tx_send_empty_int interrupt.when I2C sends more data than nonfifo_tx_thres  it will produce tx_send_empty_int interrupt..*/
      uint32_t reserved13:      19;

    };

    uint32_t val;

  } int_raw;

  union {

    struct {

      uint32_t rx_fifo_full:     1;           /*Set this bit to clear the rx_fifo_full_int interrupt.*/
      uint32_t tx_fifo_empty:    1;           /*Set this bit to clear the tx_fifo_empty_int interrupt.*/
      uint32_t rx_fifo_ovf:      1;           /*Set this bit to clear the rx_fifo_ovf_int interrupt.*/
      uint32_t end_detect:       1;           /*Set this bit to clear the end_detect_int interrupt.*/
      uint32_t slave_tran_comp:  1;           /*Set this bit to clear the slave_tran_comp_int interrupt.*/
      uint32_t arbitration_lost: 1;           /*Set this bit to clear the arbitration_lost_int interrupt.*/
      uint32_t master_tran_comp: 1;           /*Set this bit to clear the master_tran_comp interrupt.*/
      uint32_t trans_complete:   1;           /*Set this bit to clear the trans_complete_int interrupt.*/
      uint32_t time_out:         1;           /*Set this bit to clear the time_out_int interrupt.*/
      uint32_t trans_start:      1;           /*Set this bit to clear the trans_start_int interrupt.*/
      uint32_t ack_err:          1;           /*Set this bit to clear the ack_err_int interrupt.*/
      uint32_t rx_rec_full:      1;           /*Set this bit to clear the rx_rec_full_int interrupt.*/
      uint32_t tx_send_empty:    1;           /*Set this bit to clear the tx_send_empty_int interrupt.*/
      uint32_t reserved13:      19;

    };

    uint32_t val;

  } int_clr;

  union {

    struct {

      uint32_t rx_fifo_full:     1;           /*The enable bit for rx_fifo_full_int interrupt.*/
      uint32_t tx_fifo_empty:    1;           /*The enable bit for tx_fifo_empty_int interrupt.*/
      uint32_t rx_fifo_ovf:      1;           /*The enable bit for rx_fifo_ovf_int interrupt.*/
      uint32_t end_detect:       1;           /*The enable bit for end_detect_int interrupt.*/
      uint32_t slave_tran_comp:  1;           /*The enable bit for slave_tran_comp_int interrupt.*/
      uint32_t arbitration_lost: 1;           /*The enable bit for arbitration_lost_int interrupt.*/
      uint32_t master_tran_comp: 1;           /*The enable bit for master_tran_comp_int interrupt.*/
      uint32_t trans_complete:   1;           /*The enable bit for trans_complete_int interrupt.*/
      uint32_t time_out:         1;           /*The enable bit for time_out_int interrupt.*/
      uint32_t trans_start:      1;           /*The enable bit for trans_start_int interrupt.*/
      uint32_t ack_err:          1;           /*The enable bit for ack_err_int interrupt.*/
      uint32_t rx_rec_full:      1;           /*The enable bit for rx_rec_full_int interrupt.*/
      uint32_t tx_send_empty:    1;           /*The enable bit for tx_send_empty_int interrupt.*/
      uint32_t reserved13:      19;
    };

    uint32_t val;

  } int_ena;

  union {

    struct {

      uint32_t rx_fifo_full:     1;            /*The masked interrupt status for rx_fifo_full_int interrupt.*/
      uint32_t tx_fifo_empty:    1;            /*The masked interrupt status for tx_fifo_empty_int interrupt.*/
      uint32_t rx_fifo_ovf:      1;            /*The masked interrupt status for rx_fifo_ovf_int interrupt.*/
      uint32_t end_detect:       1;            /*The masked interrupt status for end_detect_int interrupt.*/
      uint32_t slave_tran_comp:  1;            /*The masked interrupt status for slave_tran_comp_int interrupt.*/
      uint32_t arbitration_lost: 1;            /*The masked interrupt status for arbitration_lost_int interrupt.*/
      uint32_t master_tran_comp: 1;            /*The masked interrupt status for master_tran_comp_int interrupt.*/
      uint32_t trans_complete:   1;            /*The masked interrupt status for trans_complete_int interrupt.*/
      uint32_t time_out:         1;            /*The masked interrupt status for time_out_int interrupt.*/
      uint32_t trans_start:      1;            /*The masked interrupt status for trans_start_int interrupt.*/
      uint32_t ack_err:          1;            /*The masked interrupt status for ack_err_int interrupt.*/
      uint32_t rx_rec_full:      1;            /*The masked interrupt status for rx_rec_full_int interrupt.*/
      uint32_t tx_send_empty:    1;            /*The masked interrupt status for tx_send_empty_int interrupt.*/
      uint32_t reserved13:      19;

