mattehicks/SCDE/components/ESP32_I2C_Master_Module/include/ESP32_I2C_Master_Module_s.h
    };

  uint32_t val;

  } int_status;

  union {

    struct {

      uint32_t time:        10;                /*This register is used to configure the clock num I2C used to hold the data after the negedge of SCL.*/
      uint32_t reserved10:  22;

    };

    uint32_t val;

  } sda_hold;

  union {

    struct {

      uint32_t time:       10;                 /*This register is used to configure the clock num I2C used to sample data on SDA after the posedge of SCL*/
      uint32_t reserved10: 22;

    };

    uint32_t val;

  } sda_sample;

  union {

    struct {

      uint32_t period:     14;                 /*This register is used to configure the clock num during SCL is low level.*/
      uint32_t reserved14: 18;

    };

    uint32_t val;

  } scl_high_period;

  uint32_t reserved_3c;

  union {

    struct {

      uint32_t time:       10;                /*This register is used to configure the clock num between the negedge of SDA and negedge of SCL for start mark.*/
      uint32_t reserved10: 22;
 
    };

    uint32_t val;

  } scl_start_hold;

  union {

    struct {

      uint32_t time:       10;                /*This register is used to configure the clock num between the posedge of SCL and the negedge of SDA for restart mark.*/
      uint32_t reserved10: 22;

    };

    uint32_t val;

  } scl_rstart_setup;

  union {

    struct {

      uint32_t time:       14;                /*This register is used to configure the clock num after the STOP bit's posedge.*/
      uint32_t reserved14: 18;
  
    };

    uint32_t val;

  } scl_stop_hold;

  union {

    struct {

      uint32_t time:       10;                /*This register is used to configure the clock num between the posedge of SCL and the posedge of SDA.*/
      uint32_t reserved10: 22;

    };

  uint32_t val;

  } scl_stop_setup;

  union {

    struct {

      uint32_t thres:      3;                 /*When input SCL's pulse width is smaller than this register value  I2C ignores this pulse.*/
      uint32_t en:         1;                 /*This is the filter enable bit for SCL.*/
      uint32_t reserved4: 28;

    };

  uint32_t val;

  } scl_filter_cfg;

  union {

    struct {

    uint32_t thres:      3;                 /*When input SCL's pulse width is smaller than this register value  I2C ignores this pulse.*/
    uint32_t en:         1;                 /*This is the filter enable bit for SDA.*/
    uint32_t reserved4: 28;

    };

  uint32_t val;

  } sda_filter_cfg;

  union {

    struct {

      uint32_t byte_num:      8;              /*Byte_num represent the number of data need to be send or data need to be received.*/
      uint32_t ack_en:        1;              /*ack_check_en  ack_exp and ack value are used to control  the ack bit.*/
      uint32_t ack_exp:       1;              /*ack_check_en  ack_exp and ack value are used to control  the ack bit.*/
      uint32_t ack_val:       1;              /*ack_check_en  ack_exp and ack value are used to control  the ack bit.*/
      uint32_t op_code:       3;              /*op_code is the command  0：RSTART   1：WRITE  2：READ  3：STOP . 4:END.*/
      uint32_t reserved14:   17;
      uint32_t done:  1;                      /*When command0 is done in I2C Master mode  this bit changes to high level.*/

    };

  uint32_t val;

  } command[16];

  uint32_t reserved_98;
  uint32_t reserved_9c;
  uint32_t reserved_a0;
  uint32_t reserved_a4;
  uint32_t reserved_a8;
  uint32_t reserved_ac;
  uint32_t reserved_b0;
  uint32_t reserved_b4;
  uint32_t reserved_b8;
  uint32_t reserved_bc;
  uint32_t reserved_c0;
  uint32_t reserved_c4;
  uint32_t reserved_c8;
  uint32_t reserved_cc;
  uint32_t reserved_d0;
  uint32_t reserved_d4;
  uint32_t reserved_d8;
  uint32_t reserved_dc;
  uint32_t reserved_e0;
  uint32_t reserved_e4;
  uint32_t reserved_e8;
  uint32_t reserved_ec;
  uint32_t reserved_f0;
  uint32_t reserved_f4;
  uint32_t date;                                  /**/
  uint32_t reserved_fc;
  uint32_t fifo_start_addr;                       /*This the start address for ram when use apb nonfifo access.*/

} ESP32_I2C_CONTROLLER_CONF_REG_t;



// -------------------------------------------------------------------------------------------------



/*
 * included from: esp-idf/blob/master/components/driver/include/driver/i2c.h
 */

#define I2C_APB_CLK_FREQ  APB_CLK_FREQ /*!< I2C source clock is APB clock, 80MHz */
#define I2C_FIFO_LEN   (32)  /*!< I2C hardware fifo length */

typedef enum {
    I2C_MODE_SLAVE = 0,   /*!< I2C slave mode */
    I2C_MODE_MASTER,      /*!< I2C master mode */
    I2C_MODE_MAX,
} i2c_mode_t;

typedef enum {
    I2C_MASTER_WRITE = 0,   /*!< I2C write data */
    I2C_MASTER_READ,        /*!< I2C read data */
} i2c_rw_t;

typedef enum {
    I2C_DATA_MODE_MSB_FIRST = 0,  /*!< I2C data msb first */
    I2C_DATA_MODE_LSB_FIRST = 1,  /*!< I2C data lsb first */
    I2C_DATA_MODE_MAX
} i2c_trans_mode_t;

typedef enum {
    I2C_CMD_RESTART = 0,   /*!<I2C restart command */
    I2C_CMD_WRITE,         /*!<I2C write command */
    I2C_CMD_READ,          /*!<I2C read command */
    I2C_CMD_STOP,          /*!<I2C stop command */
    I2C_CMD_END            /*!<I2C end command */
} i2c_opmode_t;

typedef enum {
    I2C_NUM_0 = 0,  /*!< I2C port 0 */
    I2C_NUM_1 ,     /*!< I2C port 1 */
    I2C_NUM_MAX
} i2c_port_t;

typedef enum {
    I2C_ADDR_BIT_7 = 0,    /*!< I2C 7bit address for slave mode */
    I2C_ADDR_BIT_10,       /*!< I2C 10bit address for slave mode */
    I2C_ADDR_BIT_MAX,
} i2c_addr_mode_t;

typedef enum {
    I2C_MASTER_ACK = 0x0,        /*!< I2C ack for each byte read */
    I2C_MASTER_NACK = 0x1,       /*!< I2C nack for each byte read */
    I2C_MASTER_LAST_NACK = 0x2,  /*!< I2C nack for the last byte*/
    I2C_MASTER_ACK_MAX,
} i2c_ack_type_t;



// -------------------------------------------------------------------------------------------------



/**
 * @brief I2C initialization parameters
 */
typedef struct {
    i2c_mode_t mode;      	  /*!< I2C mode */
    gpio_num_t sda_io_num;        /*!< GPIO number for I2C sda signal */
    gpio_pullup_t sda_pullup_en;  /*!< Internal GPIO pull mode for I2C sda signal*/
    gpio_num_t scl_io_num;        /*!< GPIO number for I2C scl signal */
    gpio_pullup_t scl_pullup_en;  /*!< Internal GPIO pull mode for I2C scl signal*/

    union {
        struct {
            uint32_t clk_speed;     /*!< I2C clock frequency for master mode, (no higher than 1MHz for now) */
        } master;
        struct {
            uint8_t addr_10bit_en;  /*!< I2C 10bit address mode enable for slave mode */
            uint16_t slave_addr;    /*!< I2C address for slave mode */
        } slave;
    };

} i2c_config_t;



typedef void* i2c_cmd_handle_t;    /*!< I2C command handle  */







// -------------------------------------------------------------------------------------------------



// i2c commands linked list - detailed data for one command
typedef struct {
    uint8_t byte_num;  /*!< cmd byte number */
    uint8_t ack_en;    /*!< ack check enable */
    uint8_t ack_exp;   /*!< expected ack level to get */
    uint8_t ack_val;   /*!< ack value to send */
    uint8_t *data;     /*!< data address */
    uint8_t byte_cmd;  /*!< to save cmd for one byte command mode */
    i2c_opmode_t op_code; /*!< haredware cmd type */
} i2c_cmd_t;

// i2c commands linked list - an element of the linked list
typedef struct i2c_cmd_link{
    i2c_cmd_t cmd;              /*!< command in current cmd link */
    struct i2c_cmd_link *next;  /*!< next cmd link */
} i2c_cmd_link_t;

