mattehicks/SCDE/components/ESP32_I2C_Master_Module/include/ESP32_I2C_Master_Module_s.h
// i2c commands linked list - head of linked list
typedef struct {
  i2c_cmd_link_t* head;     /*!< head of the command link */
  i2c_cmd_link_t* cur;      /*!< last node of the command link */
  i2c_cmd_link_t* free;     /*!< the first node to free of the command link */
} i2c_cmd_desc_t;

// status used in i2c commands in the linked list
typedef enum {
  I2C_STATUS_READ,      /*!< read status for current master command */
  I2C_STATUS_WRITE,     /*!< write status for current master command */
  I2C_STATUS_IDLE,      /*!< idle status for current master command */
  I2C_STATUS_ACK_ERROR, /*!< ack error status for current master command */
  I2C_STATUS_DONE,      /*!< I2C command done */
  I2C_STATUS_TIMEOUT,   /*!< I2C bus status error, and operation timeout */
} i2c_status_t;

// ?
typedef struct {
  int type;
} i2c_cmd_evt_t;

// i2c processing object that is kept in RAM
typedef struct {
  int i2c_num;                     /*!< I2C port number */
  int mode;                        /*!< I2C mode, master or slave */
  intr_handle_t intr_handle;       /*!< I2C interrupt handle*/
  int cmd_idx;                     /*!< record current command index, for master mode */
  int status;                      /*!< record current command status, for master mode */
  int rx_cnt;                      /*!< record current read index, for master mode */
  uint8_t data_buf[I2C_FIFO_LEN];  /*!< a buffer to store i2c fifo data */
  i2c_cmd_desc_t cmd_link;         /*!< I2C command link */
  QueueHandle_t cmd_evt_queue;     /*!< I2C command event queue */

#if CONFIG_SPIRAM_USE_MALLOC
  uint8_t *evt_queue_storage;      /*!< The buffer that will hold the items in the queue */
  int intr_alloc_flags;            /*!< Used to allocate the interrupt */
  StaticQueue_t evt_queue_buffer;  /*!< The buffer that will hold the queue structure*/
#endif

  xSemaphoreHandle cmd_mux;        /*!< semaphore to lock command process */
  size_t tx_fifo_remain;           /*!< tx fifo remain length, for master mode */
  size_t rx_fifo_remain;           /*!< rx fifo remain length, for master mode */
  xSemaphoreHandle slv_rx_mux;     /*!< slave rx buffer mux */
  xSemaphoreHandle slv_tx_mux;     /*!< slave tx buffer mux */
  size_t rx_buf_length;            /*!< rx buffer length */
  RingbufHandle_t rx_ring_buf;     /*!< rx ringbuffer handler of slave mode */
  size_t tx_buf_length;            /*!< tx buffer length */
  RingbufHandle_t tx_ring_buf;     /*!< tx ringbuffer handler of slave mode */
} i2c_obj_t;



// -------------------------------------------------------------------------------------------------


/*
 * typedefs of ESP32_I2C_Master Function Callbacks
 * This Fn are provided & made accessible for client modules - for operation
 */
// typedef for i2c_cmd_link_createFn - 
typedef i2c_cmd_handle_t (*i2c_cmd_link_createFn_t) ();

// typedef for i2c_cmd_link_deleteFn - 
typedef void (*i2c_cmd_link_deleteFn_t) (i2c_cmd_handle_t cmd_handle);

// typedef for i2c_cmd_link_appendFn - 
typedef esp_err_t (*i2c_cmd_link_appendFn_t) (i2c_cmd_handle_t cmd_handle, i2c_cmd_t *cmd);

// typedef for i2c_master_startFn - 
typedef esp_err_t (*i2c_master_startFn_t) (i2c_cmd_handle_t cmd_handle);

// typedef for i2c_master_stopFn - 
typedef esp_err_t (*i2c_master_stopFn_t) (i2c_cmd_handle_t cmd_handle);

// typedef for i2c_master_writeFn - 
typedef esp_err_t (*i2c_master_writeFn_t) (i2c_cmd_handle_t cmd_handle, uint8_t *data, size_t data_len, bool ack_en);

// typedef for i2c_master_write_byteFn - 
typedef esp_err_t (*i2c_master_write_byteFn_t) (i2c_cmd_handle_t cmd_handle, uint8_t data, bool ack_en);

// typedef for i2c_master_read_byteFn - 
typedef esp_err_t (*i2c_master_read_byteFn_t) (i2c_cmd_handle_t cmd_handle, uint8_t *data, i2c_ack_type_t ack);

// typedef for i2c_master_readFn - 
typedef esp_err_t (*i2c_master_readFn_t) (i2c_cmd_handle_t cmd_handle, uint8_t *data, size_t data_len, i2c_ack_type_t ack);

// typedef for i2c_master_cmd_beginFn - 
typedef esp_err_t (*i2c_master_cmd_beginFn_t) (i2c_obj_t *p_i2c, i2c_cmd_handle_t cmd_handle, TickType_t ticks_to_wait);

/*
 * ESP32_I2C_Master Fn (I2C Functions) typedef
 * Stores function callbacks provided & made accessible for client modules using this module
 */
typedef struct ESP32_I2C_Master_Fn_s {
  i2c_cmd_link_createFn_t i2c_cmd_link_createFn;           // ?
  i2c_cmd_link_deleteFn_t i2c_cmd_link_deleteFn;           // ?
  i2c_cmd_link_appendFn_t i2c_cmd_link_appendFn;           // ?
  i2c_master_startFn_t i2c_master_startFn;                 // ?
  i2c_master_stopFn_t i2c_master_stopFn;                   // ?
  i2c_master_writeFn_t i2c_master_writeFn;                 // ?
  i2c_master_write_byteFn_t i2c_master_write_byteFn;       // ?
  i2c_master_read_byteFn_t i2c_master_read_byteFn;         // ?
  i2c_master_readFn_t i2c_master_readFn;                   // ?
  i2c_master_cmd_beginFn_t i2c_master_cmd_beginFn;         // ?
} ESP32_I2C_Master_Fn_t;



// -------------------------------------------------------------------------------------------------



/** 
 * ESP32_I2C_Master_Definition stores values for operation valid only for the defined instance of an
 * loaded module. Values are initialized by HCTRLD an the loaded module itself.
 */
typedef struct ESP32_I2C_Master_Definition_s {
  Common_Definition_t common;			/*!< ... the common part of the definition */
  WebIf_Provided_t WebIf_Provided;		/*!< provided data for WebIf */
  uint8_t i2c_num;				/*!< the I2C hardware that should be used */
  i2c_config_t i2c_config;			/*!< i2c configuration */
  i2c_obj_t *i2c_obj;				/*!< the current i2c job */
  ESP32_I2C_Master_Fn_t* ESP32_I2C_Master_Fn;	/*!< ESP32_I2C_MasterFn (Functions / callbacks) accessible for client modules */
} ESP32_I2C_Master_Definition_t;



// -------------------------------------------------------------------------------------------------



/* 
 * ESP32_I2C_Master_StageXCHG stores values for operation of 2. stage design Modules (stage exchange)
 */
typedef struct ESP32_I2C_Master_StageXCHG_s {
  Common_StageXCHG_t common;		// ... the common part of the StageXCHG
  // module specific here 

} ESP32_I2C_Master_StageXCHG_t;



// -------------------------------------------------------------------------------------------------



#endif /*ESP32_I2C_MASTER_MODULE_S_H*/
